{
    "about":"पेज के बारे में",
    "sub-head":"यूजर इंटरफेस बनाने के लिए एक जावास्क्रिप्ट लाइब्रेरी",
    "Declarative-head":"कथात्मक",
    "Declarative-content":"रिएक्ट इंटरैक्टिव यूआई बनाने को दर्द रहित बनाता है। अपने एप्लिकेशन में प्रत्येक स्थिति के लिए सरल दृश्य डिज़ाइन करें, और जब आपका डेटा बदलता है तो रिएक्ट कुशलतापूर्वक सही घटकों को अपडेट और प्रस्तुत करेगा।",
    "Declarative-note":"घोषणात्मक दृश्य आपके कोड को अधिक पूर्वानुमानित और डीबग करना आसान बनाते हैं।",
    "Component-head":"घटक आधारित",
    "Component-content":"इनकैप्सुलेटेड घटकों का निर्माण करें जो अपनी स्थिति का प्रबंधन करते हैं, फिर उन्हें जटिल यूआई बनाने के लिए लिखें।",
    "Component-footer" : "चूंकि घटक तर्क टेम्प्लेट के बजाय जावास्क्रिप्ट में लिखा गया है, आप आसानी से अपने ऐप के माध्यम से समृद्ध डेटा पास कर सकते हैं और राज्य को DOM से बाहर रख सकते हैं",
    "Learn-head":"एक बार सीखें, कहीं भी लिखें",
    "Learn-content":"हम आपके बाकी प्रौद्योगिकी स्टैक के बारे में धारणा नहीं बनाते हैं, इसलिए आप मौजूदा कोड को दोबारा लिखे बिना रिएक्ट में नई सुविधाएँ विकसित कर सकते हैं।",
    "Learn-footer":"रिएक्ट नोड का उपयोग करके सर्वर पर भी रेंडर कर सकता है और रिएक्ट नेटिव का उपयोग करके पावर मोबाइल ऐप भी प्रस्तुत कर सकता है",
    "Why-react-head" :"रिएक्टजेएस का उपयोग क्यों करें?",
    "Why-react-content" : "क्योंकि रिएक्टजेएस वेब एप्लिकेशन बनाने के लिए सबसे व्यापक रूप से उपयोग की जाने वाली फ्रंट-एंड जावास्क्रिप्ट लाइब्रेरी में से एक है। दुनिया भर में लगभग 8,000 व्यवसायों ने समृद्ध यूजर इंटरफेस बनाने के लिए अन्य लोकप्रिय लाइब्रेरी और फ्रेमवर्क के मुकाबले रिएक्ट को चुना है। रिएक्ट एक फेसबुक-विकसित जावास्क्रिप्ट पैकेज है जिसका उपयोग अन्य चीजों के अलावा इंस्टाग्राम बनाने के लिए किया गया था। यह डेवलपर्स के लिए वेबसाइटों और ऐप्स के लिए तेजी से यूजर इंटरफेस बनाने के लिए रामबाण की तरह है। वर्चुअल DOM रिएक्टजेएस की मूल अवधारणा है।",
    "Why-react-2content":"पिछले उपलब्ध विकल्पों की तुलना में रिएक्ट एक नवीन तकनीक है। जावास्क्रिप्ट लाइब्रेरी की स्थापना 2011 में उस समय के फेसबुक सॉफ्टवेयर इंजीनियर जॉर्डन वॉके द्वारा की गई थी। XHP जैसे फ्रेमवर्क, PHP के लिए एक सरल HTML घटक फ्रेमवर्क, ने रिएक्ट को प्रभावित किया है। रिएक्ट का उपयोग शुरुआत में 2011 में फेसबुक के न्यूज़फ़ीड में किया गया था। इसे बाद में इंस्टाग्राम ने उठाया और अपने सिस्टम में इस्तेमाल किया। समय के साथ रिएक्ट विकसित हुआ और मई 2013 में, JSConf US में, Facebook ने इसे ओपन सोर्स के रूप में चुना।",
    "About-head":"हमारे React.js दस्तावेज़ीकरण के बारे में",
    "About-summary":"हमारे React.js प्रोजेक्ट के आधिकारिक दस्तावेज़ में आपका स्वागत है! हम आपको यहां पाकर और React.js के अंदर और बाहर नेविगेट करने में आपकी सहायता करने के लिए उत्साहित हैं।",
    "About-mission-head":"हमारा विशेष कार्य",
    "About-mission-content":"हमारा मिशन डेवलपर्स को React.js के लिए व्यापक और समझने में आसान दस्तावेज़ प्रदान करना है। हमारा मानना ​​है कि एक अच्छी तरह से प्रलेखित ढांचा डेवलपर्स के एक संपन्न समुदाय को बढ़ावा देता है, जो उन्हें अद्भुत वेब एप्लिकेशन बनाने में सक्षम बनाता है।",
    "About-contributors-head":"योगदानकर्ताओं",
    "About-contributors-content":"हमारा दस्तावेज़ीकरण एक सहयोगात्मक प्रयास है, जो हमारे योगदानकर्ताओं के समुदाय की कड़ी मेहनत और समर्पण से संभव हुआ है। हम इस परियोजना में योगदान देने वाले प्रत्येक व्यक्ति की सराहना करते हैं, चाहे कोड योगदान, बग रिपोर्ट, अनुवाद के माध्यम से, या केवल React.js के बारे में प्रचार करके।",
    "About-involved-head":"उलझना",
    "About-involved-content":"हम इस दस्तावेज़ीकरण को बेहतर बनाने में मदद के लिए समुदाय के योगदान का स्वागत करते हैं। यदि आप योगदान देने में रुचि रखते हैं, तो आरंभ करने के लिए कृपया हमारे योगदान दिशानिर्देश पढ़ें। यदि आपके कोई प्रश्न हैं, सहायता की आवश्यकता है, या किसी बग की रिपोर्ट करना चाहते हैं, तो बेझिझक हमसे संपर्क करें। हमारे React.js समुदाय का हिस्सा बनने के लिए धन्यवाद!",
    "About-FAQ-head":"अक्सर पूछे जाने वाले प्रश्न (एफएक्यू)",
    "About-FAQ-content":"React.js से संबंधित अक्सर पूछे जाने वाले प्रश्नों की एक सूची संकलित करें। उपयोगकर्ताओं के सामान्य प्रश्नों को संबोधित करें, उन्हें स्पष्ट और संक्षिप्त उत्तर प्रदान करें ताकि उन्हें ढांचे को अधिक प्रभावी ढंग से नेविगेट करने में मदद मिल सके।"
}