{
    "about":"Acerca de",
    "sub-head":"Una biblioteca de JavaScript para crear interfaces de usuario",
    "Declarative-head":"Declarativo",
    "Declarative-content":"React hace que sea sencillo crear interfaces de usuario interactivas. Diseñe vistas simples para cada estado de su aplicación y React actualizará y representará de manera eficiente solo los componentes correctos cuando cambien sus datos.",
    "Declarative-note":"Las vistas declarativas hacen que su código sea más predecible y más fácil de depurar.",
    "Component-head":"Basado en componentes",
    "Component-content":"Cree componentes encapsulados que administren su propio estado y luego compóngalos para crear interfaces de usuario complejas.",
    "Component-footer" : "Dado que la lógica de los componentes está escrita en JavaScript en lugar de plantillas, puede pasar fácilmente datos enriquecidos a través de su aplicación y mantener el estado fuera del DOM.",
    "Learn-head":"Aprenda una vez, escriba en cualquier lugar",
    "Learn-content":"No hacemos suposiciones sobre el resto de su pila de tecnología, por lo que puede desarrollar nuevas funciones en React sin tener que reescribir el código existente.",
    "Learn-footer":"React también puede renderizar en el servidor usando Node y potenciar aplicaciones móviles usando React Native.",
    "Why-react-head" :"Por qué utilizar React.JS?",
    "Why-react-content" : "Porque ReactJs es una de las bibliotecas de JavaScript front-end más utilizadas para crear aplicaciones web. Alrededor de 8.000 empresas de todo el mundo han elegido React sobre otras bibliotecas y marcos populares para crear interfaces de usuario enriquecidas. React es un paquete JavaScript desarrollado por Facebook que se utilizó para crear Instagram, entre otras cosas. Es como una panacea para que los desarrolladores creen rápidamente interfaces de usuario para sitios web y aplicaciones. El DOM virtual es la noción central de ReactJs.",
    "Why-react-2content":"React es una tecnología novedosa en comparación con las opciones disponibles anteriores. La biblioteca JavaScript fue creada en 2011 por Jordan Walke, un ingeniero de software de Facebook de la época. Marcos como XHP, un marco de componentes HTML simple para PHP, han influido en React. React se utilizó al principio en el suministro de noticias de Facebook en 2011. Más tarde fue recogido por Instagram y utilizado en su sistema. React evolucionó con el tiempo y, en mayo de 2013, en JSConf US, Facebook decidió abrirlo.",
    "About-head":"Acerca de nuestra documentación de React.js",
    "About-summary":"¡Bienvenido a la documentación oficial de nuestro proyecto React.js! Estamos emocionados de tenerlo aquí y ayudarlo a navegar por los entresijos de React.js.",
    "About-mission-head":"Nuestra misión",
    "About-mission-content":"Nuestra misión es proporcionar a los desarrolladores documentación completa y fácil de entender para React.js. Creemos que un marco bien documentado fomenta una comunidad próspera de desarrolladores, permitiéndoles crear aplicaciones web increíbles.",
    "About-contributors-head":"Colaboradores",
    "About-contributors-content":"Nuestra documentación es un esfuerzo colaborativo, posible gracias al arduo trabajo y la dedicación de nuestra comunidad de contribuyentes. Agradecemos a todas las personas que han contribuido a este proyecto, ya sea a través de contribuciones de código, informes de errores, traducciones o simplemente difundiendo información sobre React.js.",
    "About-involved-head":"Involucrarse",
    "About-involved-content":"Agradecemos las contribuciones de la comunidad para ayudar a mejorar esta documentación. Si está interesado en contribuir, lea nuestras Pautas de contribución para comenzar. Si tiene preguntas, necesita ayuda o desea informar un error, no dude en contactarnos. ¡Gracias por ser parte de nuestra comunidad React.js!",
    "About-FAQ-head":"Preguntas frecuentes (FAQ)",
    "About-FAQ-content":"Compile una lista de preguntas frecuentes relacionadas con React.js. Aborde las consultas comunes que puedan tener los usuarios, brindándoles respuestas claras y concisas para ayudarlos a navegar por el marco de manera más efectiva."
}