{
    "about":"About",
    "sub-head":"A JavaScript library for building user interfaces",
    "Declarative-head":"Declarative",
    "Declarative-content":"React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes.",
    "Declarative-note":"Declarative views make your code more predictable and easier to debug.",
    "Component-head":"Component-Based",
    "Component-content":"Build encapsulated components that manage their own state, then compose them to make complex UIs.",
    "Component-footer" : "Since component logic is written in JavaScript instead of templates, you can easily pass rich data through your app and keep state out of the DOM.",
    "Learn-head":"Learn Once, Write Anywhere",
    "Learn-content":"We don’t make assumptions about the rest of your technology stack, so you can develop new features in React without rewriting existing code.",
    "Learn-footer":"React can also render on the server using Node and power mobile apps using React Native.",
    "Why-react-head" :"Why Use React.JS? ",
    "Why-react-content" : "Because ReactJs is one of the most widely used front-end JavaScript libraries for creating Web Applications.Around 8,000 businesses around the world have chosen React over other popular libraries and frameworks for building rich user interfaces. React is a Facebook-developed JavaScript package that was used to create Instagram, among other things. It is like a panacea for developers to build user interfaces for websites and apps swiftly. The virtual DOM is the core notion of ReactJs.",
    "Why-react-2content":"React is a novel technology when compared to previous available options. The JavaScript library was established in 2011 by Jordan Walke, a Facebook software engineer of the time. Frameworks like XHP, a simple HTML component framework for PHP, have influenced React. React was used in Facebook’s newsfeed in 2011 at the beginning.  It was later picked up by Instagram and used in their system. React evolved over time, and in May 2013, at JSConf US, Facebook chose to open source it.",
    "About-head":"About Our React.js Documentation",
    "About-summary":"Welcome to the official documentation for our React.js project! We're excited to have you here and help you navigate the ins and outs of React.js.",
    "About-mission-head":"Our Mission",
    "About-mission-content":"Our mission is to provide developers with comprehensive and easy-to-understand documentation for React.js. We believe that a well-documented framework fosters a thriving community of developers, enabling them to build amazing web applications.",
    "About-contributors-head":"Contributors",
    "About-contributors-content":"Our documentation is a collaborative effort, made possible by the hard work and dedication of our community of contributors. We appreciate every individual who has contributed to this project, whether through code contributions, bug reports, translations, or simply spreading the word about React.js.",
    "About-involved-head":"Get Involved",
    "About-involved-content":"We welcome contributions from the community to help improve this documentation. If you're interested in contributing, please read our Contribution Guidelines to get started. If you have questions, need assistance, or want to report a bug, feel free to contact us. Thank you for being a part of our React.js community!",
    "About-FAQ-head":"Frequently Asked Questions (FAQs)",
    "About-FAQ-content":"Compile a list of frequently asked questions related to React.js. Address common queries users might have, providing clear and concise answers to help them navigate the framework more effectively."
}